---
format:
  html:
    title: "Python LevelUP: Data Science by Appsilon"
    subtitle: "Week 2 - Pandas"
    author: Piotr Pasza Storożenko
    theme:
        dark: darkly
        light: flatly
    toc: true
    self-contained: true
    shift-heading-level-by: -1
    number-sections: true

---

![](images/baner.png)

**Week 2 - Pandas**

In data science we rarely work on raw numbers, usually they are in the form of dataframe.
Pandas is the _go-to_ library to work with dataframes in python.

Pandas has a great documentation with lots of examples in [a cookbook](https://pandas.pydata.org/docs/user_guide/cookbook.html).

I definitely recommend to go through the [10 minutes to pandas](https://pandas.pydata.org/docs/user_guide/10min.html) official tutorial.

In [1]:
import numpy as np
import pandas as pd

## Reading data frames and creating new ones

### The simplest way to create a dataframe

Just pass a `dict` with `str` keys and some array-like things as values.

In [2]:
{
    "column_name1": [1, 2, 3],
    "column_name2": np.random.rand(3),
    # pandas has a build-in support for dates
    "column_date": pd.date_range("2022-02-24", periods=3, freq="S"),
}

{'column_name1': [1, 2, 3],
 'column_name2': array([0.83748582, 0.56657568, 0.82752758]),
 'column_date': DatetimeIndex(['2022-02-24 00:00:00', '2022-02-24 00:00:01',
                '2022-02-24 00:00:02'],
               dtype='datetime64[ns]', freq='S')}

In [3]:
pd.DataFrame({
    "column_name1": [1, 2, 3],
    "column_name2": np.random.rand(3),
    # pandas has a build-in support for dates
    "column_date": pd.date_range("2022-02-24", periods=3, freq="S"),
})

   column_name1  column_name2         column_date
0             1      0.103811 2022-02-24 00:00:00
1             2      0.427351 2022-02-24 00:00:01
2             3      0.882721 2022-02-24 00:00:02

### Reading CSV-like file

The most common scenario is to receive data in CSV-like file.
Then you can just use the default `pd.read_csv` function.

First let's look how does the file look like:

In [4]:
!head -5 data/iris.csv

"sepal.length","sepal.width","petal.length","petal.width","variety"
5.1,3.5,1.4,.2,"Setosa"
4.9,3,1.4,.2,"Setosa"
4.7,3.2,1.3,.2,"Setosa"
4.6,3.1,1.5,.2,"Setosa"

And now read it:

In [5]:
iris = pd.read_csv("data/iris.csv")
iris

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

Sometimes you may encounter tsv files, which have tabs instead of commas.
In such case you have to pass additional `sep` parameter.

In [6]:
!head -5 data/iris.tsv

sepal.length	sepal.width	petal.length	petal.width	variety
5.1	3.5	1.4	0.2	Setosa
4.9	3.0	1.4	0.2	Setosa
4.7	3.2	1.3	0.2	Setosa
4.6	3.1	1.5	0.2	Setosa

In [7]:
pd.read_csv("data/iris.tsv", sep="\t").head(3)

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa

In [8]:
pd.read_csv("data/iris.tsv", sep="\t").tail(3)

     sepal.length  sepal.width  petal.length  petal.width    variety
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

Beware that in Poland we use semicolons `;` in csv files since commas `,` are used as dots `.` in decimal numbers!
This often may cause some problems.
You can specify decimal separator with `df = pd.read_csv(FILE_PATH, sep=";", decimal=",")`.

Not always obtained csv file has header, in such cases you may want to provide the column names on dataframe read.

In [9]:
!head -5 data/iris_noheader.csv

5.1,3.5,1.4,.2,"Setosa"
4.9,3,1.4,.2,"Setosa"
4.7,3.2,1.3,.2,"Setosa"
4.6,3.1,1.5,.2,"Setosa"
5,3.6,1.4,.2,"Setosa"

In [10]:
# Wrong columns names!
pd.read_csv("data/iris_noheader.csv").head(3)

   5.1  3.5  1.4   .2  Setosa
0  4.9  3.0  1.4  0.2  Setosa
1  4.7  3.2  1.3  0.2  Setosa
2  4.6  3.1  1.5  0.2  Setosa

In [11]:
names = ["sepal.length", "sepal.width", "petal.length", "petal.width", "variety"]
pd.read_csv("data/iris_noheader.csv", names=names).head(3)

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa

Another `pd.read_csv` parameters worth mentioning:

- `header`
- `skiprows`
- `nrows`
- `parse_dates`

### Reading excel files

Unfortunately it's not uncommon to receive data in excel format.
These format is much slower to read from and should never be preferred.

Excel is not purely tabular format as you can merge different cells add plots and so on, but pandas handles it pretty well.

In [12]:
pd.read_excel("data/iris.xlsx").head(3)

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa

## Basic functions on dataframe

Without further ado, just execute them.

In [13]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal.length  150 non-null    float64
 1   sepal.width   150 non-null    float64
 2   petal.length  150 non-null    float64
 3   petal.width   150 non-null    float64
 4   variety       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [14]:
iris.describe()

       sepal.length  sepal.width  petal.length  petal.width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [15]:
iris

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [16]:
iris.sum()

sepal.length                                                876.5
sepal.width                                                 458.6
petal.length                                                563.7
petal.width                                                 179.9
variety         SetosaSetosaSetosaSetosaSetosaSetosaSetosaSeto...
dtype: object

In [17]:
iris.mean()

/tmp/ipykernel_368928/935066809.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  iris.mean()

sepal.length    5.843333
sepal.width     3.057333
petal.length    3.758000
petal.width     1.199333
dtype: float64

In [18]:
iris.max()

sepal.length          7.9
sepal.width           4.4
petal.length          6.9
petal.width           2.5
variety         Virginica
dtype: object

Select single column with:

In [19]:
iris['sepal.length']

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal.length, Length: 150, dtype: float64

In [20]:
iris.sort_values("sepal.length").head(5)

    sepal.length  sepal.width  petal.length  petal.width variety
13           4.3          3.0           1.1          0.1  Setosa
42           4.4          3.2           1.3          0.2  Setosa
38           4.4          3.0           1.3          0.2  Setosa
8            4.4          2.9           1.4          0.2  Setosa
41           4.5          2.3           1.3          0.3  Setosa

In [21]:
iris.sort_values("sepal.length", ascending=False).head(5)

     sepal.length  sepal.width  petal.length  petal.width    variety
131           7.9          3.8           6.4          2.0  Virginica
135           7.7          3.0           6.1          2.3  Virginica
122           7.7          2.8           6.7          2.0  Virginica
117           7.7          3.8           6.7          2.2  Virginica
118           7.7          2.6           6.9          2.3  Virginica

In [22]:
iris.sort_values(["sepal.length", 'sepal.width'], ascending=False).head(5)

     sepal.length  sepal.width  petal.length  petal.width    variety
131           7.9          3.8           6.4          2.0  Virginica
117           7.7          3.8           6.7          2.2  Virginica
135           7.7          3.0           6.1          2.3  Virginica
122           7.7          2.8           6.7          2.0  Virginica
118           7.7          2.6           6.9          2.3  Virginica

In [23]:
# Trick to split _query_ in multiple lines
(iris
.sort_values(
    [
        "sepal.length", 
        'sepal.width',
    ], ascending=False)
.head(5))

     sepal.length  sepal.width  petal.length  petal.width    variety
131           7.9          3.8           6.4          2.0  Virginica
117           7.7          3.8           6.7          2.2  Virginica
135           7.7          3.0           6.1          2.3  Virginica
122           7.7          2.8           6.7          2.0  Virginica
118           7.7          2.6           6.9          2.3  Virginica

## `pd.Dataframe` and `pd.Series`

The two key concepts for storing data in pandas are `pd.Dataframe` and `pd.Series`.

In [24]:
iris

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [25]:
type(iris)

pandas.core.frame.DataFrame

In [26]:
iris['sepal.length']

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal.length, Length: 150, dtype: float64

In [27]:
type(iris['sepal.length'])

pandas.core.series.Series

`pd.Dataframe` is like a whole... dataframe. Has many rows, some columns. `pd.Series` is like **an array**. 

**Each column** of dataframe is a separate `pd.Series` object!

Actually, `pd.Series` is not only an array, it's a wrapper around `np.ndarray`! So all methods and techniques we've learned apply here!

In VS Code and jupyter notebooks we can visually distinguish between series and dataframes as series dataframe are _fancier_.

You can create Series similarly to the ndarray.

In [28]:
pd.Series([1, 2, 3])

0    1
1    2
2    3
dtype: int64

In [29]:
pd.Series(np.random.rand(4))

0    0.328572
1    0.671743
2    0.227261
3    0.525717
dtype: float64

As we see, each `pd.Series` has a particular data type. 
This is important to remember.

Pandas has two ways of storing strings:

1. The old way, as `object` class. This is pretty general class and is here only for backwards compatibility.
2. As `pd.StringDtype()` aka pandas `string`. Special format that is faster and can easily handle `NA` values.

In [30]:
pd.Series(["Time", "flies", "like", "an", "arrow", "."])

0     Time
1    flies
2     like
3       an
4    arrow
5        .
dtype: object

In [31]:
pd.Series(["Time", "flies", "like", "an", "arrow", "."], dtype="string")

0     Time
1    flies
2     like
3       an
4    arrow
5        .
dtype: string

### Picking a column

Nothing fancy here, we just want to pick a column.

In all cases we can index `df` with the name of the column like so:

In [32]:
iris['sepal.width']

0      3.5
1      3.0
2      3.2
3      3.1
4      3.6
      ...
145    3.0
146    2.5
147    3.0
148    3.4
149    3.0
Name: sepal.width, Length: 150, dtype: float64

Sometimes, if the column has _nice_ name we can access it like a field.

In [33]:
iris.sepal.width  # sepal.width has a dot in the middle is not a nice name

AttributeError: 'DataFrame' object has no attribute 'sepal'

In [34]:
iris.variety  # variety is a nice name

0         Setosa
1         Setosa
2         Setosa
3         Setosa
4         Setosa
         ...
145    Virginica
146    Virginica
147    Virginica
148    Virginica
149    Virginica
Name: variety, Length: 150, dtype: object

## Indexing dataframes and series

One last piece before we can utilize dataframes is how to index them.
It is not that obvious as in case of `ndarray`s so pay close attention.

In [35]:
df = pd.DataFrame({
    'a': [1, 2, 3],
    'b': [4, 5, 6],
    'c': ["A", "B", "C"],
})
df

   a  b  c
0  1  4  A
1  2  5  B
2  3  6  C

`.iloc[]` stands for integer-location.

In [36]:
df.iloc[2, 0]  # Element from 3nd row and 1st column

3

In [37]:
df.iloc[:, 0]  # 1st column

0    1
1    2
2    3
Name: a, dtype: int64

In [38]:
# 1st row - this is rarely used as dataframes are column-oriented
df.iloc[0, :]

a    1
b    4
c    A
Name: 0, dtype: object

In [39]:
df.iloc[::2, :]  # every other element from every column

   a  b  c
0  1  4  A
2  3  6  C

In [40]:
df.iloc[[1, 2], :]  # elements from rows 1 and 2

   a  b  c
1  2  5  B
2  3  6  C

In [41]:
# It all works similarly on series except they are one dimensional
s = df['a']
s

0    1
1    2
2    3
Name: a, dtype: int64

In [42]:
s.iloc[[0, 2]]

0    1
2    3
Name: a, dtype: int64

`.loc[]` stands for location. It is used more often as you will see in examples.

We can index dataframe with vector of truths and falses.

In [43]:
df.loc[[True, False, True], :]

   a  b  c
0  1  4  A
2  3  6  C

But we can also use **columns names**.

In [44]:
df.loc[[True, False, True], 'a']

0    1
2    3
Name: a, dtype: int64

Apart from working with boolean values, `.loc[]` works with **pandas indexes**. Just keep that in mind for now.

## Querying dataframes

I would say there are 3 core functionalities dataframe handling package should take care of:

1. Querying
2. Grouping/Summarizing
3. Merging/Joining

Finally we can utility pandas to do something useful!
And it should have a lot of smaller functionalities to support these functionalities.

Let's not work on `iris` dataset as it's boring, and load sample of `flights` instead!
`flights` dataset have information on all US domestic flights in 2015.
We will now work on a sample of this data from Q1 with all flights destined to JFK airport (one of the largest in the US).

In [45]:
flights = pd.read_csv("../data/flights_Q1_JFK.csv")
flights

,YEAR,MONTH,DAY,DAY_OF_WEEK,AIRLINE,FLIGHT_NUMBER,TAIL_NUMBER,ORIGIN_AIRPORT,DESTINATION_AIRPORT,SCHEDULED_DEPARTURE,...,ARRIVAL_TIME,ARRIVAL_DELAY,DIVERTED,CANCELLED,CANCELLATION_REASON,AIR_SYSTEM_DELAY,SECURITY_DELAY,AIRLINE_DELAY,LATE_AIRCRAFT_DELAY,WEATHER_DELAY
0,2015,1,1,4,B6,304,N607JB,SJU,JFK,155,...,501.0,11.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
1,2015,1,1,4,B6,2001,N358JB,BUF,JFK,535,...,648.0,-15.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
2,2015,1,1,4,B6,2807,N190JB,PWM,JFK,535,...,635.0,-25.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
3,2015,1,1,4,B6,917,N606JB,BOS,JFK,545,...,649.0,-13.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
4,2015,1,1,4,B6,115,N284JB,SYR,JFK,555,...,705.0,-13.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
25032,2015,3,31,2,AA,30,N790AA,LAX,JFK,2325,...,758.0,-1.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
25033,2015,3,31,2,DL,1264,N692DL,SLC,JFK,2340,...,540.0,-18.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
25034,2015,3,31,2,B6,624,N934JB,LAX,JFK,2345,...,807.0,7.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
25035,2015,3,31,2,B6,66,N784JB,ABQ,JFK,2349,...,533.0,-14.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
25036,2015,3,31,2,B6,98,N646JB,DEN,JFK,2358,...,528.0,-5.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN

In [46]:
flights.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25037 entries, 0 to 25036
Data columns (total 31 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   YEAR                 25037 non-null  int64
 1   MONTH                25037 non-null  int64
 2   DAY                  25037 non-null  int64
 3   DAY_OF_WEEK          25037 non-null  int64
 4   AIRLINE              25037 non-null  object
 5   FLIGHT_NUMBER        25037 non-null  int64
 6   TAIL_NUMBER          24891 non-null  object
 7   ORIGIN_AIRPORT       25037 non-null  object
 8   DESTINATION_AIRPORT  25037 non-null  object
 9   SCHEDULED_DEPARTURE  25037 non-null  int64
 10  DEPARTURE_TIME       23693 non-null  float64
 11  DEPARTURE_DELAY      23693 non-null  float64
 12  TAXI_OUT             23679 non-null  float64
 13  WHEELS_OFF           23679 non-null  float64
 14  SCHEDULED_TIME       25037 non-null  float64
 15  ELAPSED_TIME         23561 non-null  float64
 16  AIR_TIME             23561 non-null  float64
 17  DISTANCE             25037 non-null  int64
 18  WHEELS_ON            23657 non-null  float64
 19  TAXI_IN              23657 non-null  float64
 20  SCHEDULED_ARRIVAL    25037 non-null  int64
 21  ARRIVAL_TIME         23657 non-null  float64
 22  ARRIVAL_DELAY        23561 non-null  float64
 23  DIVERTED             25037 non-null  int64
 24  CANCELLED            25037 non-null  int64
 25  CANCELLATION_REASON  1363 non-null   object
 26  AIR_SYSTEM_DELAY     6519 non-null   float64
 27  SECURITY_DELAY       6519 non-null   float64
 28  AIRLINE_DELAY        6519 non-null   float64
 29  LATE_AIRCRAFT_DELAY  6519 non-null   float64
 30  WEATHER_DELAY        6519 non-null   float64
dtypes: float64(16), int64(10), object(5)
memory usage: 5.9+ MB

Let's say we want to find flights that were delayed by more than 60 minute.

In [47]:
flights['ARRIVAL_DELAY'] > 60  # Reminder, pd.Series is nd.array

0        False
1        False
2        False
3        False
4        False
         ...
25032    False
25033    False
25034    False
25035    False
25036    False
Name: ARRIVAL_DELAY, Length: 25037, dtype: bool

In [48]:
flights.loc[flights['ARRIVAL_DELAY'] > 60, :]

,YEAR,MONTH,DAY,DAY_OF_WEEK,AIRLINE,FLIGHT_NUMBER,TAIL_NUMBER,ORIGIN_AIRPORT,DESTINATION_AIRPORT,SCHEDULED_DEPARTURE,...,ARRIVAL_TIME,ARRIVAL_DELAY,DIVERTED,CANCELLED,CANCELLATION_REASON,AIR_SYSTEM_DELAY,SECURITY_DELAY,AIRLINE_DELAY,LATE_AIRCRAFT_DELAY,WEATHER_DELAY
22,2015,1,1,4,MQ,3432,N546MQ,DCA,JFK,615,...,959.0,161.0,0,0,NaN,0.0,46.0,115.0,0.0,0.0
37,2015,1,1,4,DL,1994,N3758Y,PHX,JFK,715,...,1501.0,71.0,0,0,NaN,0.0,0.0,0.0,0.0,71.0
54,2015,1,1,4,DL,414,N710TW,SFO,JFK,830,...,1818.0,83.0,0,0,NaN,0.0,0.0,83.0,0.0,0.0
61,2015,1,1,4,AA,164,N790AA,SFO,JFK,850,...,2044.0,194.0,0,0,NaN,1.0,0.0,193.0,0.0,0.0
94,2015,1,1,4,AA,2393,N3APAA,MCO,JFK,1055,...,1507.0,102.0,0,0,NaN,0.0,0.0,0.0,102.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
24694,2015,3,30,1,B6,84,N598JB,MCO,JFK,1840,...,2325.0,120.0,0,0,NaN,0.0,0.0,63.0,57.0,0.0
24717,2015,3,30,1,AA,1406,N3KFAA,MIA,JFK,2105,...,228.0,141.0,0,0,NaN,0.0,0.0,89.0,52.0,0.0
24891,2015,3,31,2,MQ,3145,N655MQ,CMH,JFK,1233,...,1544.0,81.0,0,0,NaN,1.0,0.0,21.0,59.0,0.0
24898,2015,3,31,2,MQ,3026,N638MQ,BWI,JFK,1245,...,1456.0,64.0,0,0,NaN,44.0,0.0,20.0,0.0,0.0
25022,2015,3,31,2,UA,824,N597UA,SFO,JFK,2230,...,755.0,61.0,0,0,NaN,1.0,0.0,60.0,0.0,0.0

What if we don't want to see all those columns?
Let's pick just `YEAR, MONTH, DAY, SCHEDULED_DEPARTURE, ORIGIN_AIRPORT, ARRIVAL_DELAY`.

In [49]:
interesting_cols_list = ["YEAR", "MONTH", "DAY", "SCHEDULED_DEPARTURE", "ORIGIN_AIRPORT", "ARRIVAL_DELAY"]
flights.loc[flights['ARRIVAL_DELAY'] > 60, interesting_cols_list]

       YEAR  MONTH  DAY  SCHEDULED_DEPARTURE ORIGIN_AIRPORT  ARRIVAL_DELAY
22     2015      1    1                  615            DCA          161.0
37     2015      1    1                  715            PHX           71.0
54     2015      1    1                  830            SFO           83.0
61     2015      1    1                  850            SFO          194.0
94     2015      1    1                 1055            MCO          102.0
...     ...    ...  ...                  ...            ...            ...
24694  2015      3   30                 1840            MCO          120.0
24717  2015      3   30                 2105            MIA          141.0
24891  2015      3   31                 1233            CMH           81.0
24898  2015      3   31                 1245            BWI           64.0
25022  2015      3   31                 2230            SFO           61.0

[2456 rows x 6 columns]

Now we might wonder whether delays are longer in the evening (after 18:00) or in the morning (before 12:00).

In [50]:
# Reminder, use additional parenthesis ()!
morning_flights = flights.loc[(flights['ARRIVAL_DELAY'] > 60) & (flights['SCHEDULED_DEPARTURE'] <= 1200), interesting_cols_list]
evening_flights = flights.loc[(flights['ARRIVAL_DELAY'] > 60) & (flights['SCHEDULED_DEPARTURE'] >= 1800), interesting_cols_list]

In [51]:
morning_flights['ARRIVAL_DELAY'].mean()

141.3235800344234

In [52]:
morning_flights['ARRIVAL_DELAY'].mean(), morning_flights['ARRIVAL_DELAY'].std()

(141.3235800344234, 113.5697960010186)

In [53]:
evening_flights['ARRIVAL_DELAY'].mean(), evening_flights['ARRIVAL_DELAY'].std()

(121.10404624277457, 65.67715306804766)

Top three busiest airports in the US in 2020 were:

1. Hartsfield–Jackson Atlanta International Airport	College Park, Georgia	ATL
2. Dallas/Fort Worth International Airport	Irving, Texas	DFW		
3. Denver International Airport	Denver, Colorado	DEN

Let's count number of flights from them to JFK in 2015Q1.

In [54]:
flights.shape

(25037, 31)

In [55]:
for airport in ['ATL', 'DFW', 'DEN']:
    n = flights.loc[flights['ORIGIN_AIRPORT'] == airport, :].shape[0]
    print(f"N flights from {airport} to JFK equaled {n} in 2015Q1")

N flights from ATL to JFK equaled 449 in 2015Q1
N flights from DFW to JFK equaled 98 in 2015Q1
N flights from DEN to JFK equaled 168 in 2015Q1

What are 10 longest (in terms of distance) flights that landed on JFK in 2015Q1?
Show only data, origin airport and distance.

In [56]:
(
    flights
    .loc[:, ['YEAR', 'MONTH', 'DAY', 'ORIGIN_AIRPORT', 'DISTANCE']]
    .sort_values("DISTANCE", ascending=False)
    .head(10)
)

       YEAR  MONTH  DAY ORIGIN_AIRPORT  DISTANCE
11910  2015      2   13            HNL      4983
16123  2015      2   28            HNL      4983
15854  2015      2   27            HNL      4983
14146  2015      2   21            HNL      4983
5963   2015      1   22            HNL      4983
3817   2015      1   14            HNL      4983
13300  2015      2   18            HNL      4983
782    2015      1    3            HNL      4983
15565  2015      2   26            HNL      4983
1069   2015      1    4            HNL      4983

Well, that's not what we wanted. These are different flights from HNL - Honolulu, we want distinct origins.
We see that asking for particular date doesn't make sense here.
Let's just ask for the origin and distance.

In [57]:
ten_longest = (flights
    .loc[:, ["ORIGIN_AIRPORT", "DISTANCE"]]
    .drop_duplicates()  # useful function
    .sort_values("DISTANCE", ascending=False)
    .head(10)
)
ten_longest

    ORIGIN_AIRPORT  DISTANCE
194            HNL      4983
23             SFO      2586
250            OAK      2576
269            SJC      2569
273            SMF      2521
20             LAX      2475
257            BUR      2465
79             LGB      2465
29             PDX      2454
24             SAN      2446

That's more what we wanted!
Now, what is the number of flights for every airport in that list?

In [58]:
for airport in ten_longest['ORIGIN_AIRPORT']:
    n = flights.loc[flights['ORIGIN_AIRPORT'] == airport, :].shape[0]
    print(f"N flights from {airport} to JFK equaled {n} in 2015Q1")

N flights from HNL to JFK equaled 80 in 2015Q1
N flights from SFO to JFK equaled 2216 in 2015Q1
N flights from OAK to JFK equaled 53 in 2015Q1
N flights from SJC to JFK equaled 54 in 2015Q1
N flights from SMF to JFK equaled 55 in 2015Q1
N flights from LAX to JFK equaled 3312 in 2015Q1
N flights from BUR to JFK equaled 90 in 2015Q1
N flights from LGB to JFK equaled 143 in 2015Q1
N flights from PDX to JFK equaled 162 in 2015Q1
N flights from SAN to JFK equaled 370 in 2015Q1

We are playing around origin airports, but from which airport came the most flights to JFK? Name top 10

In [59]:
flights['ORIGIN_AIRPORT']

0        SJU
1        BUF
2        PWM
3        BOS
4        SYR
        ...
25032    LAX
25033    SLC
25034    LAX
25035    ABQ
25036    DEN
Name: ORIGIN_AIRPORT, Length: 25037, dtype: object

In [60]:
flights['ORIGIN_AIRPORT'].value_counts().head(10)

LAX    3312
SFO    2216
MCO    1400
FLL    1387
BOS    1355
SJU    1226
LAS     968
MIA     963
TPA     751
CLT     694
Name: ORIGIN_AIRPORT, dtype: int64

Now we would like to know when there are more scheduled flights, in the first half of an hour or in the second?
To do so we will **create** additional columns to already existing dataframe.

In [61]:
flights['SCHEDULED_DEPARTURE'] % 100

0        55
1        35
2        35
3        45
4        55
         ..
25032    25
25033    40
25034    45
25035    49
25036    58
Name: SCHEDULED_DEPARTURE, Length: 25037, dtype: int64

In [62]:
flights['SCHEDULED_DEPARTURE'] // 100

0         1
1         5
2         5
3         5
4         5
         ..
25032    23
25033    23
25034    23
25035    23
25036    23
Name: SCHEDULED_DEPARTURE, Length: 25037, dtype: int64

In [63]:
flights['SCHEDULED_DEPARTURE']

0         155
1         535
2         535
3         545
4         555
         ...
25032    2325
25033    2340
25034    2345
25035    2349
25036    2358
Name: SCHEDULED_DEPARTURE, Length: 25037, dtype: int64

In [65]:
flights['SCHEDULED_DEPARTURE_MINUTE'] = flights['SCHEDULED_DEPARTURE'] % 100
flights['SCHEDULED_DEPARTURE_HOUR'] = flights['SCHEDULED_DEPARTURE'] // 100
(flights['SCHEDULED_DEPARTURE_MINUTE'] < 30).mean()

0.5036945320925031

The percentage of flights in the first half of an hour seems to be almost equal 50%.

## Pandas indexes

It's time to step back and do some pre-work.
An important idea in pandas that is different from `dplyr`, `data.table`, `Dataframes.jl` is `pd.Index`.
Not always it's an integer index!

Each row and column has an index. In both dataframe and series.

In [66]:
np.random.seed(42)
df = pd.DataFrame({
    'a': np.r_[-10:10:11j],
    'b': np.random.rand(11),
    'c': pd.date_range("2022-02-24", periods=11, freq="D"),
    'd': pd.date_range("2020-02-24", periods=11, freq="D"),
})
df  # dates are of course _smart_, leap-year aware

       a         b          c          d
0  -10.0  0.374540 2022-02-24 2020-02-24
1   -8.0  0.950714 2022-02-25 2020-02-25
2   -6.0  0.731994 2022-02-26 2020-02-26
3   -4.0  0.598658 2022-02-27 2020-02-27
4   -2.0  0.156019 2022-02-28 2020-02-28
5    0.0  0.155995 2022-03-01 2020-02-29
6    2.0  0.058084 2022-03-02 2020-03-01
7    4.0  0.866176 2022-03-03 2020-03-02
8    6.0  0.601115 2022-03-04 2020-03-03
9    8.0  0.708073 2022-03-05 2020-03-04
10  10.0  0.020584 2022-03-06 2020-03-05

Row and column index of this dataframe:

In [67]:
df.index, df.columns

(RangeIndex(start=0, stop=11, step=1),
 Index(['a', 'b', 'c', 'd'], dtype='object'))

What we haven't used yet is to use integers in `loc[]`. For example we want to take the first three rows from columns `a` and `c`.

In [68]:
df.loc[:5, ['a', 'c']]

      a          c
0 -10.0 2022-02-24
1  -8.0 2022-02-25
2  -6.0 2022-02-26
3  -4.0 2022-02-27
4  -2.0 2022-02-28
5   0.0 2022-03-01

Now let's come back to indexes.

In [69]:
df2 = df.loc[df['b'] > 0.5, :]
df2

     a         b          c          d
1 -8.0  0.950714 2022-02-25 2020-02-25
2 -6.0  0.731994 2022-02-26 2020-02-26
3 -4.0  0.598658 2022-02-27 2020-02-27
7  4.0  0.866176 2022-03-03 2020-03-02
8  6.0  0.601115 2022-03-04 2020-03-03
9  8.0  0.708073 2022-03-05 2020-03-04

In [70]:
df2.index

Int64Index([1, 2, 3, 7, 8, 9], dtype='int64')

Now the index is different. This is because we selected a few rows from the original dataframe.

So `loc[]` works flawlessly with `df`.  
It gets quirky if we start using it with `df2`.
Let's select columns `a` and `c` from first 5 rows from `df2`

In [71]:
df2.loc[:5, ['a', 'c']]

     a          c
1 -8.0 2022-02-25
2 -6.0 2022-02-26
3 -4.0 2022-02-27

We got 3 rows...
That's because of `df2.index`!
`.loc[]` will always look in indexes!

For example even though `df2` has 6 rows, the last has index 9, so we can select it with:

In [72]:
df2.loc[9, :]

a                    8.0
b               0.708073
c    2022-03-05 00:00:00
d    2020-03-04 00:00:00
Name: 9, dtype: object

Not being aware of this feature/forgetting about it is a common source of error.

So the question is how to solve
> select columns `a` and `c` from first 5 rows from `df2`
 
in the best way? We must understand the `.reset_index()` method.
It adds the index as a new column (or changes series into dataframe if we call `.reset_index()` on series).
Very often (after querying, sorting) we don't need this index, we just want a fresh one.

In [73]:
df2.reset_index()

   index    a         b          c          d
0      1 -8.0  0.950714 2022-02-25 2020-02-25
1      2 -6.0  0.731994 2022-02-26 2020-02-26
2      3 -4.0  0.598658 2022-02-27 2020-02-27
3      7  4.0  0.866176 2022-03-03 2020-03-02
4      8  6.0  0.601115 2022-03-04 2020-03-03
5      9  8.0  0.708073 2022-03-05 2020-03-04

In [74]:
# It's more common to use drop=True than the default
df2.reset_index(drop=True)

     a         b          c          d
0 -8.0  0.950714 2022-02-25 2020-02-25
1 -6.0  0.731994 2022-02-26 2020-02-26
2 -4.0  0.598658 2022-02-27 2020-02-27
3  4.0  0.866176 2022-03-03 2020-03-02
4  6.0  0.601115 2022-03-04 2020-03-03
5  8.0  0.708073 2022-03-05 2020-03-04

In [75]:
df2.reset_index(drop=True).loc[:5, ['a', 'c']]

     a          c
0 -8.0 2022-02-25
1 -6.0 2022-02-26
2 -4.0 2022-02-27
3  4.0 2022-03-03
4  6.0 2022-03-04
5  8.0 2022-03-05

Another peculiarity of `loc[]`, instead of 5 rows, we got 6.
Contrary to the regular indexing, it **includes** the last element!
So we have to do:

In [76]:
df2.reset_index(drop=True).head(5).loc[:, ['a', 'c']]

     a          c
0 -8.0 2022-02-25
1 -6.0 2022-02-26
2 -4.0 2022-02-27
3  4.0 2022-03-03
4  6.0 2022-03-04

Why it makes sense to include the last as well?
Think of the following example.
The question is 
> Show all characters that lived no more than Sam Gamgee

In [77]:
df_lotr = pd.read_csv("../data/lotr_data.csv")
df_lotr.set_index("Name", inplace=True)  # for some reason we have Name as an index
df_lotr

                 Race  Salary   Profession  Age of Death
Name
Bilbo Baggins  Hobbit   10000      Retired           131
Frodo Baggins  Hobbit   70000  Ring-bearer            53
Sam Gamgee     Hobbit   60000     Security           102
Aragorn         Human   60000     Security           210

In [78]:
df_lotr.sort_values("Age of Death").loc[:'Sam Gamgee']

                 Race  Salary   Profession  Age of Death
Name
Frodo Baggins  Hobbit   70000  Ring-bearer            53
Sam Gamgee     Hobbit   60000     Security           102

As we see in the above example, the newly set index `Name` has a ... name. It's called `Name`.
Now if we do `.reset_index()` we will revert the `set_index` operation. We don't want to remove index column here.

In [79]:
df_lotr.sort_values("Age of Death").loc[:'Sam Gamgee'].reset_index()

            Name    Race  Salary   Profession  Age of Death
0  Frodo Baggins  Hobbit   70000  Ring-bearer            53
1     Sam Gamgee  Hobbit   60000     Security           102

One last example of `reset_index`.
The result of `df2.loc[9, :]` is a series, even though it doesn't make logically sense here, we can do the `reset_index`.
This will change a series into a dataframe.
It doesn't make logical sense as each column of dataframe should have a well-defined type, and here we have mix of int, float and date.

In [80]:
df2.loc[9, :].reset_index()

  index                    9
0     a                  8.0
1     b             0.708073
2     c  2022-03-05 00:00:00
3     d  2020-03-04 00:00:00

## Groupby

If you are familiar with SQL, group it will be pretty straightforward, if not let's think of questions:

- Given LoTR dataframe, count No of characters of different races (that's what `value_counts` do!)
- Given iris dataframe find the mean of `sepal.width` for every `variety`
- Given flights dataframe find the mean delay for every origin airport
- Given flights dataframe find the airline with the most flights to JFK
- Given flights dataframe find the day in which the most flights were made

Now we will answer those questions with examples

### Given LoTR dataframe, count No of characters of different races

In [205]:
df_lotr['Race'].value_counts()
# Very often we do reset_index here or just take index

Hobbit    3
Human     1
Name: Race, dtype: int64

Beware of the following pitfall:

In [82]:
(df_lotr['Race'].value_counts() > 2).index

Index(['Hobbit', 'Human'], dtype='object')

In [83]:
df_lotr['Race'].value_counts() > 2

Hobbit     True
Human     False
Name: Race, dtype: bool

Human is `False` but appears in index!

### Given iris dataframe find the mean of `sepal.width` for every `variety`

In [206]:
iris

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [208]:
# we extract the column of interest after groupby
iris.groupby('variety')['sepal.width'].mean()

variety
Setosa        3.428
Versicolor    2.770
Virginica     2.974
Name: sepal.width, dtype: float64

### Given flights dataframe find the mean delay for every origin airport

Let's sort results and see 5 airports with the smallest delays.

In [210]:
flights.columns

Index(['YEAR', 'MONTH', 'DAY', 'DAY_OF_WEEK', 'AIRLINE', 'FLIGHT_NUMBER',
       'TAIL_NUMBER', 'ORIGIN_AIRPORT', 'DESTINATION_AIRPORT',
       'SCHEDULED_DEPARTURE', 'DEPARTURE_TIME', 'DEPARTURE_DELAY', 'TAXI_OUT',
       'WHEELS_OFF', 'SCHEDULED_TIME', 'ELAPSED_TIME', 'AIR_TIME', 'DISTANCE',
       'WHEELS_ON', 'TAXI_IN', 'SCHEDULED_ARRIVAL', 'ARRIVAL_TIME',
       'ARRIVAL_DELAY', 'DIVERTED', 'CANCELLED', 'CANCELLATION_REASON',
       'AIR_SYSTEM_DELAY', 'SECURITY_DELAY', 'AIRLINE_DELAY',
       'LATE_AIRCRAFT_DELAY', 'WEATHER_DELAY', 'SCHEDULED_DEPARTURE_MINUTE',
       'SCHEDULED_DEPARTURE_HOUR', 'DATE'],
      dtype='object')

In [216]:
flights.groupby("ORIGIN_AIRPORT")['DEPARTURE_DELAY'].mean().sort_values().head()

ORIGIN_AIRPORT
SAT    0.609756
ORF    3.441558
ROC    5.858871
BTV    7.051383
BQN    7.347826
Name: DEPARTURE_DELAY, dtype: float64

In [214]:
flights["ORIGIN_AIRPORT"].value_counts()

LAX    3312
SFO    2216
MCO    1400
FLL    1387
BOS    1355
SJU    1226
LAS     968
MIA     963
TPA     751
CLT     694
PBI     640
PHX     578
BUF     550
RDU     540
DCA     527
SLC     514
RSW     482
ATL     449
SEA     438
AUS     433
MSY     399
SAN     370
ORD     316
BTV     269
SYR     266
ROC     265
IAD     256
PWM     253
JAX     232
CHS     188
SAV     180
CMH     180
STT     169
DEN     168
PDX     162
LGB     143
MSP     134
DTW     113
DFW      98
BQN      95
HOU      94
CVG      90
BUR      90
PSE      90
BWI      90
EGE      90
ORF      90
CLE      90
IND      90
BNA      90
SRQ      90
HNL      80
ABQ      58
SMF      55
SJC      54
OAK      53
SAT      42
PSP      18
JAC       2
PIT       2
Name: ORIGIN_AIRPORT, dtype: int64

In [213]:
flights.groupby("ORIGIN_AIRPORT").size()

ORIGIN_AIRPORT
ABQ      58
ATL     449
AUS     433
BNA      90
BOS    1355
BQN      95
BTV     269
BUF     550
BUR      90
BWI      90
CHS     188
CLE      90
CLT     694
CMH     180
CVG      90
DCA     527
DEN     168
DFW      98
DTW     113
EGE      90
FLL    1387
HNL      80
HOU      94
IAD     256
IND      90
JAC       2
JAX     232
LAS     968
LAX    3312
LGB     143
MCO    1400
MIA     963
MSP     134
MSY     399
OAK      53
ORD     316
ORF      90
PBI     640
PDX     162
PHX     578
PIT       2
PSE      90
PSP      18
PWM     253
RDU     540
ROC     265
RSW     482
SAN     370
SAT      42
SAV     180
SEA     438
SFO    2216
SJC      54
SJU    1226
SLC     514
SMF      55
SRQ      90
STT     169
SYR     266
TPA     751
dtype: int64

Well, usually we don't really consider landing earlier an advantage (nor a problem of course). We should set negative delays to $0$.

In [217]:
flights.groupby("ORIGIN_AIRPORT")['ARRIVAL_DELAY'].mean().sort_values().head()

ORIGIN_AIRPORT
SAT   -8.780488
ORF   -5.710526
PDX   -1.636943
PSP   -0.823529
MSP    0.077519
Name: ARRIVAL_DELAY, dtype: float64

In [86]:
flights2 = flights.copy()
flights2.loc[flights2["ARRIVAL_DELAY"] < 0, "ARRIVAL_DELAY"] = 0
flights2.groupby("ORIGIN_AIRPORT")['ARRIVAL_DELAY'].mean().sort_values().head()

ORIGIN_AIRPORT
SAT     3.878049
PSP     8.058824
ORF     9.776316
MSP    10.496124
BQN    11.923913
Name: ARRIVAL_DELAY, dtype: float64

We got an interesting insight here!
Even though on average delays from PDX airport were negative, it's not on out list!
So what were the delays from PDX?

In [218]:
flights2.groupby("ORIGIN_AIRPORT")['ARRIVAL_DELAY'].mean()

ORIGIN_AIRPORT
ABQ     19.473684
ATL     21.442890
AUS     17.864078
BNA     35.397260
BOS     25.327419
BQN     11.923913
BTV     14.067194
BUF     20.753876
BUR     16.714286
BWI     36.259740
CHS     24.908571
CLE     28.986842
CLT     19.364341
CMH     32.650602
CVG     21.594937
DCA     30.476852
DEN     31.785276
DFW     16.637363
DTW     16.074766
EGE     25.258824
FLL     25.981707
HNL     30.087500
HOU     26.164835
IAD     16.209402
IND     37.759494
JAC    149.000000
JAX     22.316742
LAS     19.330794
LAX     16.142003
LGB     17.297101
MCO     26.030098
MIA     22.820994
MSP     10.496124
MSY     20.062992
OAK     19.788462
ORD     20.889262
ORF      9.776316
PBI     26.253289
PDX     12.248408
PHX     19.945554
PIT     57.500000
PSE     18.117647
PSP      8.058824
PWM     17.171674
RDU     20.533333
ROC     13.891129
RSW     20.194690
SAN     17.623188
SAT      3.878049
SAV     23.141176
SEA     16.962175
SFO     16.982963
SJC     13.673469
SJU     21.159966
SLC     18.697581
SMF     17.192308
SRQ     12.576471
STT     29.852761
SYR     22.075397
TPA     25.493599
Name: ARRIVAL_DELAY, dtype: float64

In [87]:
flights2.groupby("ORIGIN_AIRPORT")['ARRIVAL_DELAY'].mean()["PDX"]

12.248407643312103

### Given flights dataframe find the airlane with the most flights to JFK

In [88]:
flights.columns

Index(['YEAR', 'MONTH', 'DAY', 'DAY_OF_WEEK', 'AIRLINE', 'FLIGHT_NUMBER',
       'TAIL_NUMBER', 'ORIGIN_AIRPORT', 'DESTINATION_AIRPORT',
       'SCHEDULED_DEPARTURE', 'DEPARTURE_TIME', 'DEPARTURE_DELAY', 'TAXI_OUT',
       'WHEELS_OFF', 'SCHEDULED_TIME', 'ELAPSED_TIME', 'AIR_TIME', 'DISTANCE',
       'WHEELS_ON', 'TAXI_IN', 'SCHEDULED_ARRIVAL', 'ARRIVAL_TIME',
       'ARRIVAL_DELAY', 'DIVERTED', 'CANCELLED', 'CANCELLATION_REASON',
       'AIR_SYSTEM_DELAY', 'SECURITY_DELAY', 'AIRLINE_DELAY',
       'LATE_AIRCRAFT_DELAY', 'WEATHER_DELAY', 'SCHEDULED_DEPARTURE_MINUTE',
       'SCHEDULED_DEPARTURE_HOUR'],
      dtype='object')

In [219]:
flights.loc[flights["DESTINATION_AIRPORT"] == "JFK","AIRLINE"].value_counts()

B6    10350
DL     6388
AA     3952
MQ     1518
UA     1066
VX      982
US      711
HA       70
Name: AIRLINE, dtype: int64

In [220]:
flights["AIRLINE"].value_counts().index[0]

'B6'

### Given flights dataframe find the day in which the most flights were made

In [91]:
(
    flights
    .groupby(["MONTH", "DAY"])  # for every MONTH, for every DAY
    .size()  # size gives you size of each ["MONTH", "DAY"] group
)

MONTH  DAY
1      1      277
       2      305
       3      280
       4      303
       5      301
             ...
3      27     291
       28     262
       29     292
       30     290
       31     281
Length: 90, dtype: int64

In [223]:
(
    flights
    .groupby(["MONTH", "DAY"])
    .size()
    .sort_values(ascending=False)
    .reset_index(name="N Flights")
    .head(1)
)

   MONTH  DAY  N Flights
0      1    2        305

### Find the minimum, mean and maximum `ARRIVAL_DELAY` for every airline, as well as minimum `DEPARTURE_TIME`

In [227]:
flights.groupby("AIRLINE").agg({
    "ARRIVAL_DELAY": ['min', 'mean', 'max'],
    "DEPARTURE_TIME": ['min', np.median]
})

        ARRIVAL_DELAY                    DEPARTURE_TIME
                  min       mean     max            min  median
AIRLINE
AA              -60.0  10.522388  1211.0            6.0  1247.0
B6              -59.0  14.476792   641.0            1.0  1313.5
DL              -51.0  14.742329  1038.0            2.0  1253.0
HA              -43.0  25.171429  1391.0         1526.0  1622.0
MQ              -45.0  21.027153   511.0          549.0  1257.0
UA              -53.0   5.532101   320.0           42.0  1311.5
US              -36.0  14.139850   447.0          132.0  1402.5
VX              -43.0   8.553305   326.0            6.0  1345.0

We can also use our custom functions in agg/aggregate.

In [228]:
def my_aggregator(x):
    return x.mean() / x.std()

In [229]:
flights.groupby("AIRLINE").agg({
    "ARRIVAL_DELAY": ['min', 'mean', 'max', my_aggregator],
    "DEPARTURE_TIME": 'min'
})

        ARRIVAL_DELAY                                  DEPARTURE_TIME
                  min       mean     max my_aggregator            min
AIRLINE
AA              -60.0  10.522388  1211.0      0.188913            6.0
B6              -59.0  14.476792   641.0      0.281552            1.0
DL              -51.0  14.742329  1038.0      0.234640            2.0
HA              -43.0  25.171429  1391.0      0.146072         1526.0
MQ              -45.0  21.027153   511.0      0.393583          549.0
UA              -53.0   5.532101   320.0      0.113806           42.0
US              -36.0  14.139850   447.0      0.305834          132.0
VX              -43.0   8.553305   326.0      0.190980            6.0

## Joining data frames

The last piece of the puzzle is joining different dataframes.
For example we know that PDX is an interesting airport and B6 an interesting airline, but what are their's full names?

Since we airlines and airports dataframes, we can the answers!

In [231]:
airlines = pd.read_csv("../data/airlines.csv")
airlines

   IATA_CODE                       AIRLINE
0         UA         United Air Lines Inc.
1         AA        American Airlines Inc.
2         US               US Airways Inc.
3         F9        Frontier Airlines Inc.
4         B6               JetBlue Airways
5         OO         Skywest Airlines Inc.
6         AS          Alaska Airlines Inc.
7         NK              Spirit Air Lines
8         WN        Southwest Airlines Co.
9         DL          Delta Air Lines Inc.
10        EV   Atlantic Southeast Airlines
11        HA        Hawaiian Airlines Inc.
12        MQ  American Eagle Airlines Inc.
13        VX                Virgin America

In [99]:
airlines.loc[airlines['IATA_CODE'] == "B6", :]

  IATA_CODE          AIRLINE
4        B6  JetBlue Airways

In [232]:
airports = pd.read_csv("../data/airports.csv")
airports.head()

,IATA_CODE,AIRPORT,CITY,STATE,COUNTRY,LATITUDE,LONGITUDE
0,ABE,Lehigh Valley International Airport,Allentown,PA,USA,40.65236,-75.44040
1,ABI,Abilene Regional Airport,Abilene,TX,USA,32.41132,-99.68190
2,ABQ,Albuquerque International Sunport,Albuquerque,NM,USA,35.04022,-106.60919
3,ABR,Aberdeen Regional Airport,Aberdeen,SD,USA,45.44906,-98.42183
4,ABY,Southwest Georgia Regional Airport,Albany,GA,USA,31.53552,-84.19447

In [233]:
airports.loc[airports['IATA_CODE'] == "PDX"]

,IATA_CODE,AIRPORT,CITY,STATE,COUNTRY,LATITUDE,LONGITUDE
236,PDX,Portland International Airport,Portland,OR,USA,45.58872,-122.5975

Well we can check airports' names one by one, but it doesn't scale...

Let's recall this dataframe:

In [235]:
top_ten_popular = (
    flights['ORIGIN_AIRPORT']
    .value_counts()
    .head(10)
    .reset_index(name="Count")
)
top_ten_popular

  index  Count
0   LAX   3312
1   SFO   2216
2   MCO   1400
3   FLL   1387
4   BOS   1355
5   SJU   1226
6   LAS    968
7   MIA    963
8   TPA    751
9   CLT    694

We will (finally!) meet the `rename` function, nothing special but useful.

In [236]:
top_ten_popular.rename(columns={'index':'ORIGIN_AIRPORT'}, inplace=True)
top_ten_popular

  ORIGIN_AIRPORT  Count
0            LAX   3312
1            SFO   2216
2            MCO   1400
3            FLL   1387
4            BOS   1355
5            SJU   1226
6            LAS    968
7            MIA    963
8            TPA    751
9            CLT    694

Now it's high time we join this dataframe with airports.

In [237]:
airports.head()

,IATA_CODE,AIRPORT,CITY,STATE,COUNTRY,LATITUDE,LONGITUDE
0,ABE,Lehigh Valley International Airport,Allentown,PA,USA,40.65236,-75.44040
1,ABI,Abilene Regional Airport,Abilene,TX,USA,32.41132,-99.68190
2,ABQ,Albuquerque International Sunport,Albuquerque,NM,USA,35.04022,-106.60919
3,ABR,Aberdeen Regional Airport,Aberdeen,SD,USA,45.44906,-98.42183
4,ABY,Southwest Georgia Regional Airport,Albany,GA,USA,31.53552,-84.19447

In [238]:
# And they are merged!
top_ten_popular.merge(  # left dataframe to merge
    airports,  # right dataframe to merge
    left_on="ORIGIN_AIRPORT",  # column from the left dataframe
    right_on="IATA_CODE",  # column from the right dataframe
)

,ORIGIN_AIRPORT,Count,IATA_CODE,AIRPORT,CITY,STATE,COUNTRY,LATITUDE,LONGITUDE
0,LAX,3312,LAX,Los Angeles International Airport,Los Angeles,CA,USA,33.94254,-118.40807
1,SFO,2216,SFO,San Francisco International Airport,San Francisco,CA,USA,37.61900,-122.37484
2,MCO,1400,MCO,Orlando International Airport,Orlando,FL,USA,28.42889,-81.31603
3,FLL,1387,FLL,Fort Lauderdale-Hollywood International Airport,Ft. Lauderdale,FL,USA,26.07258,-80.15275
4,BOS,1355,BOS,Gen. Edward Lawrence Logan International Airport,Boston,MA,USA,42.36435,-71.00518
5,SJU,1226,SJU,Luis Muñoz Marín International Airport,San Juan,PR,USA,18.43942,-66.00183
6,LAS,968,LAS,McCarran International Airport,Las Vegas,NV,USA,36.08036,-115.15233
7,MIA,963,MIA,Miami International Airport,Miami,FL,USA,25.79325,-80.29056
8,TPA,751,TPA,Tampa International Airport,Tampa,FL,USA,27.97547,-82.53325
9,CLT,694,CLT,Charlotte Douglas International Airport,Charlotte,NC,USA,35.21401,-80.94313

In [239]:
# Pick just a few columns
(
    top_ten_popular
    .merge(airports, left_on="ORIGIN_AIRPORT", right_on="IATA_CODE")
    .loc[:, ['AIRPORT', 'IATA_CODE', "CITY", 'Count']]
)

,AIRPORT,IATA_CODE,CITY,Count
0,Los Angeles International Airport,LAX,Los Angeles,3312
1,San Francisco International Airport,SFO,San Francisco,2216
2,Orlando International Airport,MCO,Orlando,1400
3,Fort Lauderdale-Hollywood International Airport,FLL,Ft. Lauderdale,1387
4,Gen. Edward Lawrence Logan International Airport,BOS,Boston,1355
5,Luis Muñoz Marín International Airport,SJU,San Juan,1226
6,McCarran International Airport,LAS,Las Vegas,968
7,Miami International Airport,MIA,Miami,963
8,Tampa International Airport,TPA,Tampa,751
9,Charlotte Douglas International Airport,CLT,Charlotte,694

Find the airline and airport of the longest flight.

In [107]:
airlines

   IATA_CODE                       AIRLINE
0         UA         United Air Lines Inc.
1         AA        American Airlines Inc.
2         US               US Airways Inc.
3         F9        Frontier Airlines Inc.
4         B6               JetBlue Airways
5         OO         Skywest Airlines Inc.
6         AS          Alaska Airlines Inc.
7         NK              Spirit Air Lines
8         WN        Southwest Airlines Co.
9         DL          Delta Air Lines Inc.
10        EV   Atlantic Southeast Airlines
11        HA        Hawaiian Airlines Inc.
12        MQ  American Eagle Airlines Inc.
13        VX                Virgin America

In [245]:
flights.loc[flights["ELAPSED_TIME"].argmin(), :]

YEAR                                         2015
MONTH                                           2
DAY                                            26
DAY_OF_WEEK                                     4
AIRLINE                                        MQ
FLIGHT_NUMBER                                3026
TAIL_NUMBER                                N682MQ
ORIGIN_AIRPORT                                BWI
DESTINATION_AIRPORT                           JFK
SCHEDULED_DEPARTURE                          1450
DEPARTURE_TIME                             1814.0
DEPARTURE_DELAY                             204.0
TAXI_OUT                                      9.0
WHEELS_OFF                                 1823.0
SCHEDULED_TIME                               75.0
ELAPSED_TIME                                 50.0
AIR_TIME                                     36.0
DISTANCE                                      184
WHEELS_ON                                  1859.0
TAXI_IN                                       5.0
SCHEDULED_ARRIVAL                            1605
ARRIVAL_TIME                               1904.0
ARRIVAL_DELAY                               179.0
DIVERTED                                        0
CANCELLED                                       0
CANCELLATION_REASON                           NaN
AIR_SYSTEM_DELAY                              0.0
SECURITY_DELAY                                0.0
AIRLINE_DELAY                                 0.0
LATE_AIRCRAFT_DELAY                         179.0
WEATHER_DELAY                                 0.0
SCHEDULED_DEPARTURE_MINUTE                     50
SCHEDULED_DEPARTURE_HOUR                       14
DATE                          2015-02-26 00:00:00
Name: 15540, dtype: object

In [246]:
flights.loc[flights["ELAPSED_TIME"] == flights["ELAPSED_TIME"].min(), :]

,YEAR,MONTH,DAY,DAY_OF_WEEK,AIRLINE,FLIGHT_NUMBER,TAIL_NUMBER,ORIGIN_AIRPORT,DESTINATION_AIRPORT,SCHEDULED_DEPARTURE,...,CANCELLED,CANCELLATION_REASON,AIR_SYSTEM_DELAY,SECURITY_DELAY,AIRLINE_DELAY,LATE_AIRCRAFT_DELAY,WEATHER_DELAY,SCHEDULED_DEPARTURE_MINUTE,SCHEDULED_DEPARTURE_HOUR,DATE
15540,2015,2,26,4,MQ,3026,N682MQ,BWI,JFK,1450,...,0,NaN,0.0,0.0,0.0,179.0,0.0,50,14,2015-02-26
16891,2015,3,3,2,B6,315,N317JB,SYR,JFK,1133,...,0,NaN,NaN,NaN,NaN,NaN,NaN,33,11,2015-03-03

In [247]:
flights.loc[flights["ELAPSED_TIME"] == flights["ELAPSED_TIME"].max(), ["YEAR", "MONTH", "DAY", "AIRLINE", "FLIGHT_NUMBER", "TAIL_NUMBER", "ORIGIN_AIRPORT", "DESTINATION_AIRPORT"]].merge(airlines, left_on="AIRLINE", right_on="IATA_CODE").merge(airports, left_on="ORIGIN_AIRPORT", right_on="IATA_CODE", suffixes=("", "_ORIGIN")).merge(airports, left_on="DESTINATION_AIRPORT", right_on="IATA_CODE", suffixes=("", "_DESTINATION")).iloc[0]

YEAR                                                                  2015
MONTH                                                                    3
DAY                                                                     14
AIRLINE_x                                                               HA
FLIGHT_NUMBER                                                           50
TAIL_NUMBER                                                         N386HA
ORIGIN_AIRPORT                                                         HNL
DESTINATION_AIRPORT                                                    JFK
IATA_CODE                                                               HA
AIRLINE_y                                           Hawaiian Airlines Inc.
IATA_CODE_ORIGIN                                                       HNL
AIRPORT                                     Honolulu International Airport
CITY                                                              Honolulu
STATE                                                                   HI
COUNTRY                                                                USA
LATITUDE                                                          21.31869
LONGITUDE                                                       -157.92241
IATA_CODE_DESTINATION                                                  JFK
AIRPORT_DESTINATION      John F. Kennedy International Airport (New Yor...
CITY_DESTINATION                                                  New York
STATE_DESTINATION                                                       NY
COUNTRY_DESTINATION                                                    USA
LATITUDE_DESTINATION                                              40.63975
LONGITUDE_DESTINATION                                            -73.77893
Name: 0, dtype: object

In [109]:
cols = ["YEAR", "MONTH", "DAY", "AIRLINE", "FLIGHT_NUMBER", "TAIL_NUMBER", "ORIGIN_AIRPORT", "DESTINATION_AIRPORT"]
(
    flights
    .loc[flights["ELAPSED_TIME"] == flights["ELAPSED_TIME"].max(), cols]
    .merge(airlines, left_on="AIRLINE", right_on="IATA_CODE")
    .merge(airports, left_on="ORIGIN_AIRPORT", right_on="IATA_CODE", suffixes=("", "_ORIGIN"))
    .merge(airports, left_on="DESTINATION_AIRPORT", right_on="IATA_CODE", suffixes=("", "_DESTINATION"))
    .iloc[0]
)

YEAR                                                                  2015
MONTH                                                                    3
DAY                                                                     14
AIRLINE_x                                                               HA
FLIGHT_NUMBER                                                           50
TAIL_NUMBER                                                         N386HA
ORIGIN_AIRPORT                                                         HNL
DESTINATION_AIRPORT                                                    JFK
IATA_CODE                                                               HA
AIRLINE_y                                           Hawaiian Airlines Inc.
IATA_CODE_ORIGIN                                                       HNL
AIRPORT                                     Honolulu International Airport
CITY                                                              Honolulu
STATE                                                                   HI
COUNTRY                                                                USA
LATITUDE                                                          21.31869
LONGITUDE                                                       -157.92241
IATA_CODE_DESTINATION                                                  JFK
AIRPORT_DESTINATION      John F. Kennedy International Airport (New Yor...
CITY_DESTINATION                                                  New York
STATE_DESTINATION                                                       NY
COUNTRY_DESTINATION                                                    USA
LATITUDE_DESTINATION                                              40.63975
LONGITUDE_DESTINATION                                            -73.77893
Name: 0, dtype: object

For more content on merging please checkout [the detailed tutorial in the documentation](https://pandas.pydata.org/docs/user_guide/merging.html#database-style-dataframe-or-named-series-joining-merging).

## Advanced usage and useful functions

### Dealing with `NA` values

The topic of dealing with `NA` values is very broad.
A few articles you might want to read:

- [What are missing data?](https://www.analyticsvidhya.com/blog/2021/10/handling-missing-value)
- [How to handle them in pandas?](https://www.analyticsvidhya.com/blog/2021/05/dealing-with-missing-values-in-python-a-complete-guide/)

Today I'll just show two basic methods:

- Remove columns/rows with `NA`
- Fill `NA` with constant value

In [252]:
df = pd.DataFrame({
    "a": [1, 2, 3, pd.NA, 5],
    "b": ["a", "b", "c", "d", None],
    "c": [pd.NA, 1.0, np.nan, np.nan, 2.2],
    "d": np.arange(5),
    "e": [np.nan, 1.0, 2.0, 3.0, 4.0]
})
df

      a     b     c  d    e
0     1     a  <NA>  0  NaN
1     2     b   1.0  1  1.0
2     3     c   NaN  2  2.0
3  <NA>     d   NaN  3  3.0
4     5  None   2.2  4  4.0

In [111]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       4 non-null      object
 1   b       4 non-null      object
 2   c       2 non-null      object
 3   d       5 non-null      int64
 4   e       4 non-null      float64
dtypes: float64(1), int64(1), object(3)
memory usage: 328.0+ bytes

Drop all rows with things pandas consider `NA`

In [112]:
df.dropna()

   a  b    c  d    e
1  2  b  1.0  1  1.0

Drop all columns with values pandas consider `NA`.

In [113]:
df.dropna(axis='columns')

   d
0  0
1  1
2  2
3  3
4  4

Drop rows that have `NA` in columns `a` or `b`.

In [114]:
df.dropna(subset=['a', 'b'])

   a  b     c  d    e
0  1  a  <NA>  0  NaN
1  2  b   1.0  1  1.0
2  3  c   NaN  2  2.0

Now let's fill `NA`.
First let's fill all `NA` with 0.

In [115]:
df.fillna(0)

   a  b    c  d    e
0  1  a  0.0  0  0.0
1  2  b  1.0  1  1.0
2  3  c  0.0  2  2.0
3  0  d  0.0  3  3.0
4  5  0  2.2  4  4.0

Since it doesn't make sense to fill strings with 0 we can do something like to fill column `b` with empty string and the rest with `0`:

In [254]:
dff = df.fillna({'b':""}).fillna(0)
dff

   a  b    c  d    e
0  1  a  0.0  0  0.0
1  2  b  1.0  1  1.0
2  3  c  0.0  2  2.0
3  0  d  0.0  3  3.0
4  5     2.2  4  4.0

In [255]:
dff.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       5 non-null      int64
 1   b       5 non-null      object
 2   c       5 non-null      float64
 3   d       5 non-null      int64
 4   e       5 non-null      float64
dtypes: float64(2), int64(2), object(1)
memory usage: 328.0+ bytes

### `df.query()`

Writing lines like

```python
flights.loc[(flights['ARRIVAL_DELAY'] > 60) & (flights['SCHEDULED_DEPARTURE'] <= 1200), interesting_cols_list]
```

gets tedious very quickly.
Fortunately in pandas we have `query`, sometimes a bit less intuitive, yet very powerful feature, read more in [the documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.query.html).

In [119]:
flights.query("ARRIVAL_DELAY > 60 and SCHEDULED_DEPARTURE <= 1200").loc[:, interesting_cols_list]

       YEAR  MONTH  DAY  SCHEDULED_DEPARTURE ORIGIN_AIRPORT  ARRIVAL_DELAY
22     2015      1    1                  615            DCA          161.0
37     2015      1    1                  715            PHX           71.0
54     2015      1    1                  830            SFO           83.0
61     2015      1    1                  850            SFO          194.0
94     2015      1    1                 1055            MCO          102.0
...     ...    ...  ...                  ...            ...            ...
24555  2015      3   30                 1005            RSW           90.0
24560  2015      3   30                 1040            CLT           69.0
24567  2015      3   30                 1101            BOS           91.0
24569  2015      3   30                 1105            PWM          238.0
24584  2015      3   30                 1138            ROC           63.0

[581 rows x 6 columns]

In [256]:
min_delay = 15
flights.query("ARRIVAL_DELAY > @min_delay").loc[:, interesting_cols_list]

       YEAR  MONTH  DAY  SCHEDULED_DEPARTURE ORIGIN_AIRPORT  ARRIVAL_DELAY
15     2015      1    1                  600            FLL           17.0
16     2015      1    1                  600            SJU           59.0
22     2015      1    1                  615            DCA          161.0
37     2015      1    1                  715            PHX           71.0
52     2015      1    1                  818            FLL           40.0
...     ...    ...  ...                  ...            ...            ...
25006  2015      3   31                 2115            SFO           18.0
25010  2015      3   31                 2135            LAX           42.0
25017  2015      3   31                 2200            LAS           28.0
25022  2015      3   31                 2230            SFO           61.0
25026  2015      3   31                 2255            LAX           25.0

[6339 rows x 6 columns]

In [257]:
max_delay = 60
flights.query("ARRIVAL_DELAY > @min_delay and ARRIVAL_DELAY < @max_delay").loc[:, interesting_cols_list]

       YEAR  MONTH  DAY  SCHEDULED_DEPARTURE ORIGIN_AIRPORT  ARRIVAL_DELAY
15     2015      1    1                  600            FLL           17.0
16     2015      1    1                  600            SJU           59.0
52     2015      1    1                  818            FLL           40.0
67     2015      1    1                  920            SFO           46.0
80     2015      1    1                 1010            MIA           16.0
...     ...    ...  ...                  ...            ...            ...
24991  2015      3   31                 2004            FLL           28.0
25006  2015      3   31                 2115            SFO           18.0
25010  2015      3   31                 2135            LAX           42.0
25017  2015      3   31                 2200            LAS           28.0
25026  2015      3   31                 2255            LAX           25.0

[3840 rows x 6 columns]

In [258]:
flights.query("@min_delay < ARRIVAL_DELAY < @max_delay").loc[:, interesting_cols_list]

       YEAR  MONTH  DAY  SCHEDULED_DEPARTURE ORIGIN_AIRPORT  ARRIVAL_DELAY
15     2015      1    1                  600            FLL           17.0
16     2015      1    1                  600            SJU           59.0
52     2015      1    1                  818            FLL           40.0
67     2015      1    1                  920            SFO           46.0
80     2015      1    1                 1010            MIA           16.0
...     ...    ...  ...                  ...            ...            ...
24991  2015      3   31                 2004            FLL           28.0
25006  2015      3   31                 2115            SFO           18.0
25010  2015      3   31                 2135            LAX           42.0
25017  2015      3   31                 2200            LAS           28.0
25026  2015      3   31                 2255            LAX           25.0

[3840 rows x 6 columns]

### `pd.Series.apply`

A lot of mathematical operations can be done on the whole columns at once:

In [120]:
np.sin(np.pi + np.log(df_lotr['Salary'] ** 2))  # random math operations

Name
Bilbo Baggins    0.415848
Frodo Baggins    0.315850
Sam Gamgee       0.013051
Aragorn          0.013051
Name: Salary, dtype: float64

But sometimes you may have a function that takes a single argument and you want to apply it to every value in a column.
Then you can use the `apply` function on `pd.Series`.

In [121]:
def complicated_function(x):
    return x + 2 * 2

In [122]:
df_lotr['Salary'].apply(complicated_function)

Name
Bilbo Baggins    10004
Frodo Baggins    70004
Sam Gamgee       60004
Aragorn          60004
Name: Salary, dtype: int64

Very often you pass functions as lambdas this way:

In [123]:
df_lotr['Salary'].apply(lambda x: x + 2 * 2)

Name
Bilbo Baggins    10004
Frodo Baggins    70004
Sam Gamgee       60004
Aragorn          60004
Name: Salary, dtype: int64

### `pd.Series.str` accessor

It's common to work with strings.
Pandas has a dedicated features to work with strings efficiently.
You can access them by accessing `.str` on Series with strings.

[More in documentation.](https://pandas.pydata.org/docs/user_guide/text.html#indexing-with-str)

In [259]:
df_lotr2 = df_lotr.reset_index()
df_lotr2

            Name    Race  Salary   Profession  Age of Death
0  Bilbo Baggins  Hobbit   10000      Retired           131
1  Frodo Baggins  Hobbit   70000  Ring-bearer            53
2     Sam Gamgee  Hobbit   60000     Security           102
3        Aragorn   Human   60000     Security           210

In [260]:
df_lotr2['Name'].str.split(" ")

0    [Bilbo, Baggins]
1    [Frodo, Baggins]
2       [Sam, Gamgee]
3           [Aragorn]
Name: Name, dtype: object

This way we can count number of words in each name.

In [126]:
df_lotr2['Name'].str.split(" ").apply(len)

0    2
1    2
2    2
3    1
Name: Name, dtype: int64

In [127]:
df_lotr2['Name'].str.replace("o", "0")

0    Bilb0 Baggins
1    Fr0d0 Baggins
2       Sam Gamgee
3          Arag0rn
Name: Name, dtype: object

In [128]:
df_lotr2['Name'].str.len()

0    13
1    13
2    10
3     7
Name: Name, dtype: int64

### Usage of regular expressions to filter text

When working with downloaded texts it's common that the text needs some preprocessing.
You might need to filter out unnecessary new lines `\n`, maybe some html tags like `<p>` and `<\p>` and many more.
Very often it's done with [regular expressions](https://en.wikipedia.org/wiki/Regular_expression).
They are often useful to find all hashtags, mentions, emails in text.
Here I'll show an example on how to create this kind of processors.
Very often you don't write regex on your own, but rather find it on the internet.
The following example comes from [stack overflow](https://stackoverflow.com/a/12982689/16521949).

In [262]:
import re
CLEANR = re.compile('<.*?>') 

def cleanhtml(raw_html):
    cleantext = re.sub(CLEANR, '', raw_html)
    return cleantext

In [263]:
s  = r"<p>Text with <strong>not relevant<\strong> HTML tags.<\p>"
s

'<p>Text with <strong>not relevant<\\strong> HTML tags.<\\p>'

In [264]:
cleanhtml(s)

'Text with not relevant HTML tags.'

If you would like to make this function work with `pd.Series.apply` you might need to adjust it in a following way:

In [132]:
def cleanhtml(raw_html):
    if isinstance(raw_html, str):
        cleantext = re.sub(CLEANR, '', raw_html)
        return cleantext
    else:
        return raw_html

Now the code is `NA`-proof.

### `pd.Series.dt` accessor

Similar concept to `pd.Series.str` but to work with **datatime** data type!

[More in documentation.](https://pandas.pydata.org/docs/reference/api/pandas.Series.dt.date.html)

In [266]:
df = pd.DataFrame({
    'values': np.arange(14),
    'time': pd.Series(pd.date_range("2022-06-20", periods=14, freq="d")),
})
df['time']

0    2022-06-20
1    2022-06-21
2    2022-06-22
3    2022-06-23
4    2022-06-24
5    2022-06-25
6    2022-06-26
7    2022-06-27
8    2022-06-28
9    2022-06-29
10   2022-06-30
11   2022-07-01
12   2022-07-02
13   2022-07-03
Name: time, dtype: datetime64[ns]

In [134]:
df['time'].dt.dayofweek

0     0
1     1
2     2
3     3
4     4
5     5
6     6
7     0
8     1
9     2
10    3
11    4
12    5
13    6
Name: time, dtype: int64

In [135]:
df['time'].dt.quarter

0     2
1     2
2     2
3     2
4     2
5     2
6     2
7     2
8     2
9     2
10    2
11    3
12    3
13    3
Name: time, dtype: int64

In [136]:
df['time'].dt.isocalendar().week

0     25
1     25
2     25
3     25
4     25
5     25
6     25
7     26
8     26
9     26
10    26
11    26
12    26
13    26
Name: week, dtype: UInt32

In [268]:
flights['DATE'] = pd.to_datetime(flights['YEAR'].astype(str) + "-" + flights['MONTH'].astype(str) + "-" + flights["DAY"].astype(str))

In [138]:
flights3 = flights.set_index("DATE")
flights3

,YEAR,MONTH,DAY,DAY_OF_WEEK,AIRLINE,FLIGHT_NUMBER,TAIL_NUMBER,ORIGIN_AIRPORT,DESTINATION_AIRPORT,SCHEDULED_DEPARTURE,...,DIVERTED,CANCELLED,CANCELLATION_REASON,AIR_SYSTEM_DELAY,SECURITY_DELAY,AIRLINE_DELAY,LATE_AIRCRAFT_DELAY,WEATHER_DELAY,SCHEDULED_DEPARTURE_MINUTE,SCHEDULED_DEPARTURE_HOUR
DATE,,,,,,,,,,,,,,,,,,,,,
2015-01-01,2015,1,1,4,B6,304,N607JB,SJU,JFK,155,...,0,0,NaN,NaN,NaN,NaN,NaN,NaN,55,1
2015-01-01,2015,1,1,4,B6,2001,N358JB,BUF,JFK,535,...,0,0,NaN,NaN,NaN,NaN,NaN,NaN,35,5
2015-01-01,2015,1,1,4,B6,2807,N190JB,PWM,JFK,535,...,0,0,NaN,NaN,NaN,NaN,NaN,NaN,35,5
2015-01-01,2015,1,1,4,B6,917,N606JB,BOS,JFK,545,...,0,0,NaN,NaN,NaN,NaN,NaN,NaN,45,5
2015-01-01,2015,1,1,4,B6,115,N284JB,SYR,JFK,555,...,0,0,NaN,NaN,NaN,NaN,NaN,NaN,55,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2015-03-31,2015,3,31,2,AA,30,N790AA,LAX,JFK,2325,...,0,0,NaN,NaN,NaN,NaN,NaN,NaN,25,23
2015-03-31,2015,3,31,2,DL,1264,N692DL,SLC,JFK,2340,...,0,0,NaN,NaN,NaN,NaN,NaN,NaN,40,23
2015-03-31,2015,3,31,2,B6,624,N934JB,LAX,JFK,2345,...,0,0,NaN,NaN,NaN,NaN,NaN,NaN,45,23
2015-03-31,2015,3,31,2,B6,66,N784JB,ABQ,JFK,2349,...,0,0,NaN,NaN,NaN,NaN,NaN,NaN,49,23
2015-03-31,2015,3,31,2,B6,98,N646JB,DEN,JFK,2358,...,0,0,NaN,NaN,NaN,NaN,NaN,NaN,58,23

Advanced data grouping, every 14 days.

In [271]:
flights3.groupby(pd.Grouper(freq="10D"))['ARRIVAL_DELAY'].mean()

DATE
2015-01-01    19.921271
2015-01-11     4.143337
2015-01-21     4.977362
2015-01-31    16.325084
2015-02-10    13.945448
2015-02-20    20.404112
2015-03-02    12.935350
2015-03-12    25.069392
2015-03-22     4.853324
Freq: 10D, Name: ARRIVAL_DELAY, dtype: float64

### More on reading data

If you encounter strange data type, like `xml` file for the whole table, try using functions like `read_xml`.

Sometimes you your data is not nice and polished and contains some errors. In those cases it might be useful to set `on_bad_lines='warn'` in `read_csv`. The default value is `on_bad_lines='error'` and pandas raises an exception if the line is corrupted.

### `pd.read_csv` and large dataframes

We will briefly explore ways of dealing with large dataframes in `pandas>=1.4`.
We will measure execution time and space occupied on disk.
Pay attention to the **Wall time**.
Let's create a large dataframe with 10 milion rows.

In [272]:
N = 10_000_000
df_test = pd.DataFrame({
    'col_int': np.random.randint(100000, size=N),
    'col_str': "val_" + pd.Series(np.random.rand(N).astype(str)),
    'col_factor': np.random.randint(5, size=N),
})
df_test.head(3)

   col_int                  col_str  col_factor
0    89152  val_0.17246103830290227           2
1    59875   val_0.8695976782523426           1
2    65194  val_0.18808564836788055           0

First save it to a simple csv file:

In [273]:
%time df_test.to_csv("data/largedf.csv", index=False)

CPU times: user 18.7 s, sys: 461 ms, total: 19.1 s
Wall time: 19.2 s

In [ ]:
!head -3 data/largedf.csv

col_int,col_str,col_factor
93070,val_0.040997446935206905,2
44950,val_0.7375223867504072,4

And now to csv file compressed with `zst`, [the SoTA compression standard](https://github.com/facebook/zstd) as of 2022.

In [274]:
%time df_test.to_csv("data/largedf.csv.zst", index=False)

CPU times: user 30.7 s, sys: 315 ms, total: 31.1 s
Wall time: 31.2 s

Compression takes some additional time but the resulting size is much smaller!

In [275]:
!ls -sh data/largedf*

298M data/largedf.csv  130M data/largedf.csv.zst

Not let's look at reading times:

In [276]:
%time df_tmp = pd.read_csv("data/largedf.csv")

CPU times: user 8.19 s, sys: 935 ms, total: 9.13 s
Wall time: 9.16 s

In [277]:
%time df_tmp = pd.read_csv("data/largedf.csv.zst")

CPU times: user 10.2 s, sys: 887 ms, total: 11 s
Wall time: 11.1 s

In [278]:
%time df_tmp = pd.read_csv("data/largedf.csv", engine='pyarrow')

CPU times: user 7.29 s, sys: 1.89 s, total: 9.18 s
Wall time: 5.3 s

In [279]:
%time df_tmp = pd.read_csv("data/largedf.csv.zst", engine='pyarrow')

CPU times: user 7.95 s, sys: 1.49 s, total: 9.44 s
Wall time: 6.53 s

Reading the compressed file with `pyarrow` is faster than reading uncompressed file in the default settings!
You shouldn't use it when not necessary, but sometimes it's very helpful.

### `polars` -- a faster substitution of `pandas`

Pandas is the most common library and you MUST know it to communicate with other people.
Sometimes however, pandas might be to slow. In those cases you might want to take a look at [polars](https://github.com/pola-rs/polars).

This is also a dataframe for in-memory data wrangling, but is usually [much faster](https://h2oai.github.io/db-benchmark/)!
One of many advantages polars have is ability to compare the whole query before executing with so-called [lazy evaluation](https://en.wikipedia.org/wiki/Lazy_evaluation).
I won't go into polars details, but just compare execution speed of an example query.


With March 2022 data from Spanish Wikipedia, let's find which article was the biggest Wikipedia _hub_, i.e., from which article people went to other articles the most often.

In [280]:
columns = ['prev', 'curr', 'type', 'n']

In [281]:
%%time
df = pd.read_csv(f"../data/clickstream-eswiki-2022-03.tsv.gz", sep="\t", names=columns, on_bad_lines='warn')

CPU times: user 4.8 s, sys: 230 ms, total: 5.03 s
Wall time: 5.04 s

In [282]:
%%time 
(
    df
    .query("type == 'link'")
    .groupby("prev")['n']
    .sum()
    .sort_values(ascending=False)
    .index[0]
)

CPU times: user 2.55 s, sys: 99.7 ms, total: 2.65 s
Wall time: 2.65 s

'Copa_Mundial_de_Fútbol_de_2022'

In [283]:
import polars as pl

In [284]:
%%time 
dfl = pl.read_csv("../data/clickstream-eswiki-2022-03.tsv.gz", sep="\t", has_header=False,new_columns=columns)

CPU times: user 1.85 s, sys: 685 ms, total: 2.54 s
Wall time: 972 ms

In [285]:
%%time 
q = (
    dfl.lazy()
    .filter(pl.col("type") == "link")
    .groupby("prev")
    .agg(
        [
            pl.col("n").sum().alias("count")
        ]
    )
    .sort("count", reverse=True)
    .limit(1)
)
q.collect()[0, 'prev']

CPU times: user 1.94 s, sys: 239 ms, total: 2.18 s
Wall time: 339 ms

'Copa_Mundial_de_Fútbol_de_2022'

- Do I use `polars` every day? 
- Not really.
- Why? 
- Because I work with other people...
- But it is so much faster!
- Only on larger datasets, with small <100k rows you will probably not see much difference.

Polars has of course much smaller set of supported functionalities, but is it a problem?
Not so much!

In [204]:
df_temp = dfl.filter(pl.col("type") == "link")
# Not we switch to pandas
df_pandas = dfl.to_pandas()
# And perform _pandas only_ operation
df_pandas2 = df_pandas.groupby("prev")['n'].sum().reset_index()
# Before going back to polars
dfl2 = pl.from_pandas(df_pandas2)
dfl2

shape: (369540, 2)
┌────────────────────┬─────┐
│ prev               ┆ n   │
│ ---                ┆ --- │
│ str                ┆ i64 │
╞════════════════════╪═════╡
│ !!!                ┆ 13  │
├╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌┼╌╌╌╌╌┤
│ !Kung              ┆ 16  │
├╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌┼╌╌╌╌╌┤
│ $                  ┆ 58  │
├╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌┼╌╌╌╌╌┤
│ $_(desambiguación) ┆ 10  │
├╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌┼╌╌╌╌╌┤
│ ...                ┆ ... │
├╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌┼╌╌╌╌╌┤
│ 𐤑                  ┆ 15  │
├╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌┼╌╌╌╌╌┤
│ 𐤒                  ┆ 12  │
├╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌┼╌╌╌╌╌┤
│ 𐤓                  ┆ 11  │
├╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌┼╌╌╌╌╌┤
│ 𐤕                  ┆ 12  │
└────────────────────┴─────┘